import "./Text.css";

const PrivacyPolicy = () => {
  return (
    <section className="Text-Container">
      <h2>개인정보처리방침</h2>
      <br />
      <h3>
        <strong>제1조(목적)</strong>
      </h3>
      <p>
        여기저기(이하 ‘회사'라고 함)는 회사가 제공하고자 하는 서비스(이하 ‘회사
        서비스’)를 이용하는 개인(이하 ‘이용자’ 또는 ‘개인’)의 정보(이하
        ‘개인정보’)를 보호하기 위해, 개인정보보호법, 정보통신망 이용촉진 및
        정보보호 등에 관한 법률(이하 '정보통신망법') 등 관련 법령을 준수하고,
        서비스 이용자의 개인정보 보호 관련한 고충을 신속하고 원활하게 처리할 수
        있도록 하기 위하여 다음과 같이 개인정보처리방침(이하 ‘본 방침’)을
        수립합니다.
      </p>
      <br />
      <h3>
        <strong>제2조(개인정보 처리의 원칙)</strong>
      </h3>
      <p>
        개인정보 관련 법령 및 본 방침에 따라 회사는 이용자의 개인정보를 수집할
        수 있으며 수집된 개인정보는 개인의 동의가 있는 경우에 한해 제3자에게
        제공될 수 있습니다. 단, 법령의 규정 등에 의해 적법하게 강제되는 경우
        회사는 수집한 이용자의 개인정보를 사전에 개인의 동의 없이 제3자에게
        제공할 수도 있습니다.
      </p>
      <br />
      <h3>
        <strong>제3조(본 방침의 공개)</strong>
      </h3>
      <ol>
        <li>
          회사는 이용자가 언제든지 쉽게 본 방침을 확인할 수 있도록 회사 홈페이지
          첫 화면 또는 첫 화면과의 연결화면을 통해 본 방침을 공개하고 있습니다.
        </li>
        <li>
          회사는 제1항에 따라 본 방침을 공개하는 경우 글자 크기, 색상 등을
          활용하여 이용자가 본 방침을 쉽게 확인할 수 있도록 합니다.
        </li>
      </ol>
      <br />
      <h3>
        <strong>제4조(본 방침의 변경)</strong>
      </h3>
      <ol>
        <li>
          본 방침은 개인정보 관련 법령, 지침, 고시 또는 정부나 회사 서비스의
          정책이나 내용의 변경에 따라 개정될 수 있습니다.
        </li>
        <li>
          회사는 제1항에 따라 본 방침을 개정하는 경우 다음 각 호 하나 이상의
          방법으로 공지합니다.
          <ol>
            <li>
              회사가 운영하는 인터넷 홈페이지의 첫 화면의 공지사항란 또는 별도의
              창을 통하여 공지하는 방법
            </li>
            <li>
              서면·모사전송·전자우편 또는 이와 비슷한 방법으로 이용자에게
              공지하는 방법
            </li>
          </ol>
        </li>
        <li>
          회사는 제2항의 공지는 본 방침 개정의 시행일로부터 최소 7일 이전에
          공지합니다. 다만, 이용자 권리의 중요한 변경이 있을 경우에는 최소 30일
          전에 공지합니다.
        </li>
      </ol>
      <br />
      <h3>
        <strong>제5조(회원 가입을 위한 정보)</strong>
      </h3>
      <p>
        회사는 이용자의 회사 서비스에 대한 회원가입을 위하여 다음과 같은 정보를
        수집합니다.
      </p>
      <ol>
        <li>
          필수 수집 정보:&nbsp;<span>이메일 주소, 이름 및 닉네임</span>
        </li>
      </ol>
      <br />
      <h3>
        <strong>제6조(개인정보 수집 방법)</strong>
      </h3>
      <p>회사는 다음과 같은 방법으로 이용자의 개인정보를 수집합니다.</p>
      <ol>
        <li>이용자가 회사의 홈페이지에 자신의 개인정보를 입력하는 방식</li>
        <li>
          어플리케이션 등 회사가 제공하는 홈페이지 외의 서비스를 통해 이용자가
          자신의 개인정보를 입력하는 방식
        </li>
      </ol>
      <br />
      <h3>
        <strong>제7조(개인정보의 이용)</strong>
      </h3>
      <p>회사는 개인정보를 다음 각 호의 경우에 이용합니다.</p>
      <ol>
        <li>공지사항의 전달 등 회사운영에 필요한 경우</li>
        <li>
          이용문의에 대한 회신, 불만의 처리 등 이용자에 대한 서비스 개선을 위한
          경우
        </li>
        <li>회사의 서비스를 제공하기 위한 경우</li>
        <li>
          법령 및 회사 약관을 위반하는 회원에 대한 이용 제한 조치, 부정 이용
          행위를 포함하여 서비스의 원활한 운영에 지장을 주는 행위에 대한 방지 및
          제재를 위한 경우
        </li>
      </ol>
      <br />
      <h3>
        <strong>제8조(사전동의 등에 따른 개인정보의 제공)</strong>
      </h3>
      <ol>
        <li>
          회사는 개인정보 제3자 제공 금지에도 불구하고, 이용자가 사전에
          공개하거나 다음 각호 사항에 대하여 동의한 경우에는 제3자에게
          개인정보를 제공할 수 있습니다. 다만 이 경우에도 회사는 관련 법령
          내에서 최소한으로 개인정보를 제공합니다.
          <ol>
            <li>
              <span>Google</span>에게 <span>서비스 이용</span>을 위하여{" "}
              <span>회원가입, 서비스 이용을 위한 정보</span>을 제공
            </li>
          </ol>
        </li>
        <li>
          회사는 전항의 제3자 제공 관계에 변화가 있거나 제3자 제공 관계가 종결될
          때도 같은 절차에 의해 이용자에게 고지 및 동의를 구합니다.
        </li>
      </ol>
      <br />
      <h3>
        <strong>제9조(개인정보의 보유 및 이용기간)</strong>
      </h3>
      <ol>
        <li>
          회사는 이용자의 개인정보에 대해 개인정보의 수집·이용 목적 달성을 위한
          기간 동안 개인정보를 보유 및 이용합니다.
        </li>
        <li>
          전항에도 불구하고 회사는 내부 방침에 의해 서비스 부정이용기록은 부정
          가입 및 이용 방지를 위하여 회원 탈퇴 시점으로부터 최대 1년간
          보관합니다.
        </li>
      </ol>
      <br />
      <h3>
        <strong>제10조(개인정보의 파기원칙 및 절차)</strong>
      </h3>
      <p>
        회사는 원칙적으로 이용자의 개인정보 처리 목적의 달성, 보유·이용기간의
        경과 등 개인정보가 필요하지 않을 경우에는 해당 정보를 지체 없이
        파기합니다.
      </p>
      <ol>
        <li>
          이용자가 회원가입 등을 위해 입력한 정보는 개인정보 처리 목적이 달성된
          후 별도의 DB로 옮겨 내부 방침 및 기타 관련 법령에 의한 정보보호 사유에
          따라(보유 및 이용기간 참조) 일정 기간 저장된 후 파기 되어집니다.
        </li>
        <li>
          회사는 파기 사유가 발생한 개인정보를 개인정보보호 책임자의 승인절차를
          거쳐 파기합니다.
        </li>
      </ol>
      <br />
      <h3>
        <strong>제11조(개인정보파기방법)</strong>
      </h3>
      <p>
        회사는 전자적 파일형태로 저장된 개인정보는 기록을 재생할 수 없는 기술적
        방법을 사용하여 삭제합니다.
      </p>
      <br />
      <h3>
        <strong>제12조(이용자의 의무)</strong>
      </h3>
      <ol>
        <li>
          이용자는 자신의 개인정보를 최신의 상태로 유지해야 하며, 이용자의
          부정확한 정보 입력으로 발생하는 문제의 책임은 이용자 자신에게
          있습니다.
        </li>
        <li>
          타인의 개인정보를 도용한 회원가입의 경우 이용자 자격을 상실하거나 관련
          개인정보보호 법령에 의해 처벌받을 수 있습니다.
        </li>
        <li>
          이용자는 전자우편주소, 비밀번호 등에 대한 보안을 유지할 책임이 있으며
          제3자에게 이를 양도하거나 대여할 수 없습니다.
        </li>
      </ol>
      <p>
        <br />
      </p>
      <h3>
        <strong>제13조(회사의 개인정보 관리)</strong>
      </h3>
      <p>
        회사는 이용자의 개인정보를 처리함에 있어 개인정보가 분실, 도난, 유출,
        변조, 훼손 등이 되지 아니하도록 안전성을 확보하기 위하여 필요한
        기술적·관리적 보호대책을 강구하고 있습니다.
      </p>
      <p>
        <br />
      </p>
      <h3>
        <strong>제14조(삭제된 정보의 처리)</strong>
      </h3>
      <p>
        회사는 이용자 혹은 법정 대리인의 요청에 의해 해지 또는 삭제된 개인정보는
        회사가 수집하는 "개인정보의 보유 및 이용기간"에 명시된 바에 따라
        처리하고 그 외의 용도로 열람 또는 이용할 수 없도록 처리하고 있습니다.
      </p>
      <br />
      <h3>
        <strong>제15조(비밀번호의 암호화)</strong>
      </h3>
      <p>
        이용자의 비밀번호는 Google Firebase에 저장 및 관리되고 있으며,
        개인정보의 확인, 변경은 비밀번호를 알고 있는 본인에 의해서만 가능합니다.
      </p>
      <br />
      <h3>
        <strong>제16조(해킹 등에 대비한 대책)</strong>
      </h3>
      <p>
        회사는 해킹, 컴퓨터 바이러스 등 정보통신망 침입에 의해 이용자의
        개인정보가 유출되거나 훼손되는 것을 막기 위해 최선을 다하고 있으며,
        민감한 개인정보(를 수집 및 보유하고 있는 경우)를 암호화 통신 등을 통하여
        네트워크상에서 개인정보를 안전하게 전송할 수 있도록 하고 있습니다.
      </p>
      <br />
      <h3>
        <strong>제17조(개인정보 유출 등에 대한 조치)</strong>
      </h3>
      <p>
        회사는 개인정보의 분실·도난·유출(이하 "유출 등"이라 한다) 사실을 안
        때에는 지체 없이 다음 각 호의 모든 사항을 해당 이용자에게 알리고
        방송통신위원회 또는 한국인터넷진흥원에 신고합니다.
      </p>
      <ol>
        <li>유출 등이 된 개인정보 항목</li>
        <li>유출 등이 발생한 시점</li>
        <li>이용자가 취할 수 있는 조치</li>
        <li>정보통신서비스 제공자 등의 대응 조치</li>
      </ol>
      <br />
      <h3>
        <strong>제18조(개인정보 유출 등에 대한 조치의 예외)</strong>
      </h3>
      <p>
        회사는 전조에도 불구하고 이용자의 연락처를 알 수 없는 등 정당한 사유가
        있는 경우에는 회사의 홈페이지에 30일 이상 게시하는 방법으로 전조의
        통지를 갈음하는 조치를 취할 수 있습니다.
      </p>
      <br />
      <h3>
        <strong>제19조(권익침해에 대한 구제방법)</strong>
      </h3>
      <ol>
        <li>
          정보주체는 개인정보침해로 인한 구제를 받기 위하여
          개인정보분쟁조정위원회, 한국인터넷진흥원 개인정보침해신고센터 등에
          분쟁해결이나 상담 등을 신청할 수 있습니다. 이 밖에 기타 개인정보침해의
          신고, 상담에 대하여는 아래의 기관에 문의하시기 바랍니다.
          <ol>
            <li>
              개인정보분쟁조정위원회 : (국번없이) 1833-6972 (www.kopico.go.kr)
            </li>
            <li>개인정보침해신고센터 : (국번없이) 118 (privacy.kisa.or.kr)</li>
            <li>대검찰청 : (국번없이) 1301 (www.spo.go.kr)</li>
            <li>경찰청 : (국번없이) 182 (ecrm.cyber.go.kr)</li>
          </ol>
        </li>
        <li>
          회사는 정보주체의 개인정보자기결정권을 보장하고, 개인정보침해로 인한
          상담 및 피해 구제를 위해 노력하고 있으며, 신고나 상담이 필요한 경우
          제1항의 담당부서로 연락해주시기 바랍니다.
        </li>
        <li>
          개인정보 보호법 제35조(개인정보의 열람), 제36조(개인정보의 정정·삭제),
          제37조(개인정보의 처리정지 등)의 규정에 의한 요구에 대 하여 공공기관의
          장이 행한 처분 또는 부작위로 인하여 권리 또는 이익의 침해를 받은 자는
          행정심판법이 정하는 바에 따라 행정심판을 청구할 수 있습니다.
          <ol>
            <li>중앙행정심판위원회 : (국번없이) 110 (www.simpan.go.kr)</li>
          </ol>
        </li>
      </ol>
      <p>
        <strong>
          <br />
          부칙
        </strong>
      </p>
      <p>
        제1조 본 방침은 <span>2024.08.28.</span>부터 시행됩니다.
      </p>
    </section>
  );
};

export default PrivacyPolicy;
