export type Item = {
  addr1: string;
  addr2: string;
  areacode: string;
  booktour: string;
  cat1: string;
  cat2: string;
  cat3: string;
  contentid: string;
  contenttypeid: string;
  createdtime: string;
  eventstartdate?: string;
  eventenddate?: string;
  firstimage: string;
  firstimage2: string;
  mapx: string;
  mapy: string;
  mlevel: string;
  sigungucode: string;
  tel: string;
  title: string;
};

export type FetchRespon = {
  response: {
    body: {
      items: {
        item: Item[];
      };
    };
  };
};

export type Month = {
  [key: string]: Item[];
};

export type Region = {
  [key: string]: Item[];
};

export interface FetchParams {
  areaCode: string;
  type: string;
  title: string;
  keyword?: string;
}

type It = {
  rnum: string;
  code: string;
  name: string;
};

export type Sigun = {
  response: {
    body: {
      items: {
        item: It[];
      };
    };
  };
};

export const 지역코드: { [key: string]: string } = {
  "1": "서울",
  "2": "인천",
  "3": "대전",
  "4": "대구",
  "5": "광주",
  "6": "부산",
  "7": "울산",
  "8": "세종",
  "31": "경기",
  "32": "강원",
  "33": "충북",
  "34": "충남",
  "35": "경북",
  "36": "경남",
  "37": "전북",
  "38": "전남",
  "39": "제주",
};

export const 시군코드: { [key: string]: { [key: string]: string } } = {
  서울: {
    "1": "강남구",
    "2": "강동구",
    "3": "강북구",
    "4": "강서구",
    "5": "관악구",
    "6": "광진구",
    "7": "구로구",
    "8": "금천구",
    "9": "노원구",
    "10": "도봉구",
    "11": "동대문구",
    "12": "동작구",
    "13": "마포구",
    "14": "서대문구",
    "15": "서초구",
    "16": "성동구",
    "17": "성북구",
    "18": "송파구",
    "19": "양천구",
    "20": "영등포구",
    "21": "용산구",
    "22": "은평구",
    "23": "종로구",
    "24": "중구",
    "25": "중랑구",
  },
  인천: {
    "1": "강화군",
    "2": "계양구",
    "3": "미추홀구",
    "4": "남동구",
    "5": "동구",
    "6": "부평구",
    "7": "서구",
    "8": "연수구",
    "9": "옹진군",
    "10": "중구",
  },
  대전: { "1": "대덕구", "2": "동구", "3": "서구", "4": "유성구", "5": "중구" },
  대구: {
    "1": "남구",
    "2": "달서구",
    "3": "달성군",
    "4": "동구",
    "5": "북구",
    "6": "서구",
    "7": "수성구",
    "8": "중구",
  },
  광주: { "1": "광산구", "2": "남구", "3": "동구", "4": "북구", "5": "서구" },
  부산: {
    "1": "강서구",
    "2": "금정구",
    "3": "기장군",
    "4": "남구",
    "5": "동구",
    "6": "동래구",
    "7": "부산진구",
    "8": "북구",
    "9": "사상구",
    "10": "사하구",
  },
  울산: { "1": "중구", "2": "남구", "3": "동구", "4": "북구", "5": "울주군" },
  세종: { "1": "세종특별자치시" },
  경기: {
    "1": "가평군",
    "2": "고양시",
    "3": "과천시",
    "4": "광명시",
    "5": "광주시",
    "6": "구리시",
    "7": "군포시",
    "8": "김포시",
    "9": "남양주시",
    "10": "동두천시",
  },
  강원: {
    "1": "강릉시",
    "2": "고성군",
    "3": "동해시",
    "4": "삼척시",
    "5": "속초시",
    "6": "양구군",
    "7": "양양군",
    "8": "영월군",
    "9": "원주시",
    "10": "인제군",
  },
  충북: {
    "1": "괴산군",
    "2": "단양군",
    "3": "보은군",
    "4": "영동군",
    "5": "옥천군",
    "6": "음성군",
    "7": "제천시",
    "8": "진천군",
    "9": "청원군",
    "10": "청주시",
  },
  충남: {
    "1": "공주시",
    "2": "금산군",
    "3": "논산시",
    "4": "당진시",
    "5": "보령시",
    "6": "부여군",
    "7": "서산시",
    "8": "서천군",
    "9": "아산시",
    "11": "예산군",
  },
  경북: {
    "1": "경산시",
    "2": "경주시",
    "3": "고령군",
    "4": "구미시",
    "5": "군위군",
    "6": "김천시",
    "7": "문경시",
    "8": "봉화군",
    "9": "상주시",
    "10": "성주군",
  },
  경남: {
    "1": "거제시",
    "2": "거창군",
    "3": "고성군",
    "4": "김해시",
    "5": "남해군",
    "6": "마산시",
    "7": "밀양시",
    "8": "사천시",
    "9": "산청군",
    "10": "양산시",
  },
  전북: {
    "1": "고창군",
    "2": "군산시",
    "3": "김제시",
    "4": "남원시",
    "5": "무주군",
    "6": "부안군",
    "7": "순창군",
    "8": "완주군",
    "9": "익산시",
    "10": "임실군",
  },
  전남: {
    "1": "강진군",
    "2": "고흥군",
    "3": "곡성군",
    "4": "광양시",
    "5": "구례군",
    "6": "나주시",
    "7": "담양군",
    "8": "목포시",
    "9": "무안군",
    "10": "보성군",
  },
  제주: { "1": "남제주군", "2": "북제주군", "3": "서귀포시", "4": "제주시" },
};
